---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartAllNonZero
source: html/84fd6e14-7c7c-4c71-1067-fcf078d950e7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalMemberForceStartAllNonZero Property

"All non 0 forces at start"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalMemberForceStartAllNonZero { get; }
```